Конфигурация/InformationRegisters/АффилированныеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>АффилированныеЛица</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЯвляетсяАффилированным</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОснования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоляАкций</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержаниеИзменения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Гражданство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АффилированноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияАффилированныхЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/КодыВоВнешнихСистемах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КодыВоВнешнихСистемах</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>55</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДопКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>55</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопКод1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>55</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопКод0</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеЗначения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВнешняяСистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаОбъектов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыИмпортируемыхОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/РеквизитыЮридическихЛицАнкетные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РеквизитыЮридическихЛицАнкетные</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КраткоеНаименованиеПоУставу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолноеНаименованиеПоУставу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СокращенноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КППКрупнейшегоНалогоплательщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганизационноПравоваяФорма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизационноПравовыеФормы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>350</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКАТО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачиОГРН</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганВыдавшийОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезидентРФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>TIN</Name>
					<Comment>Taxpayer Identification Number</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КИО</Name>
					<Comment>Код иностранной организации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтранаРегистрации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЮридическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЮридическийАдресФИАС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическийАдресФИАС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтовыйАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтовыйАдресФИАС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>EMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Телефоны</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Факсы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВебСтраница</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезидентПо173ФЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоНахождения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МеждународнаяКомпания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособСозданияМеждународнойКомпании</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыСозданияМеждународнойКомпании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Языки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/АффилированныеЛица/Forms/ФормаЗагрузкиИзФайла/Ext/Form/Module.bsl
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЭтоАдресВременногоХранилища(Параметры.АдресВоВременномХранилище) Тогда
		Если НРег(Параметры.ТипФайла) = ".xml" Тогда
			ЗаполнитьТаблицуИзФайлаXML(Параметры.АдресВоВременномХранилище);
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Загрузка из файлов '" + Параметры.ТипФайла + "' не поддерживается",,,, Отказ); 
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

#Область Обработчики_событий_элементов_формы

&НаКлиенте
Процедура АффилированныеЛицаАффилированноеЛицоПриИзменении(Элемент)
	
	ТекСтрока = Элементы.АффилированныеЛица.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекСтрока.АффилированноеЛицо) Тогда
		ОбновитьСтатусы(ТекСтрока.АффилированноеЛицо);
	Иначе
		ТекСтрока.ТекущееСостояние = "";
		ТекСтрока.ЯвляетсяАффилированным = Неопределено;
		ТекСтрока.ЕстьИзменения = Истина;
	КонецЕсли; 	
	ТекСтрока.ЕстьОшибки = Не (ЗначениеЗаполнено(ТекСтрока.АффилированноеЛицо) И ЗначениеЗаполнено(ТекСтрока.Основание));
	
КонецПроцедуры

&НаКлиенте
Процедура АффилированныеЛицаОснованиеПриИзменении(Элемент)
	
	ТекСтрока = Элементы.АффилированныеЛица.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекСтрока.АффилированноеЛицо) Тогда
		ОбновитьСтатусы(ТекСтрока.АффилированноеЛицо);
	Иначе
		ТекСтрока.ТекущееСостояние = "";
		ТекСтрока.ЯвляетсяАффилированным = Неопределено;
		ТекСтрока.ЕстьИзменения = Истина;
	КонецЕсли; 	
	ТекСтрока.ЕстьОшибки = Не (ЗначениеЗаполнено(ТекСтрока.АффилированноеЛицо) И ЗначениеЗаполнено(ТекСтрока.Основание));
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ОбновитьСтатусы();
КонецПроцедуры

&НаКлиенте
Процедура ЮридическоеЛицоПриИзменении(Элемент)
	ОбновитьСтатусы();
КонецПроцедуры

#КонецОбласти 

#Область Команды_формы

&НаКлиенте
Процедура ЗаписатьИзменения(Команда)
	
	СтрокиСОшибками = ЭтаФорма.АффилированныеЛица.НайтиСтроки(Новый Структура("ЕстьОшибки", Истина));
	ТекстВопроса = "Внимание! В списке присутствуют строки с ошибками заполнения." + Символы.ПС
		+ "Выполнить импорт с ошибками?";
	
	Если СтрокиСОшибками.Количество() = 0
		Или Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет) = КодВозвратаДиалога.Да Тогда
	
		ЗаписатьИзмененияНаСервере();
		Закрыть(КодВозвратаДиалога.ОК);
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьСтрокиБезИзменений(Команда)
	
	Элементы.АффилированныеЛицаСкрытьСтрокиБезИзменений.Пометка = Не Элементы.АффилированныеЛицаСкрытьСтрокиБезИзменений.Пометка;
	Если Элементы.АффилированныеЛицаКомандаТолькоСтрокиСОшибкамиЗаполнения.Пометка Тогда
		Элементы.АффилированныеЛицаКомандаТолькоСтрокиСОшибкамиЗаполнения.Пометка = Не Элементы.АффилированныеЛицаСкрытьСтрокиБезИзменений.Пометка;
	КонецЕсли; 
	
	ОтборСтрок = Новый Структура;
	Если Элементы.АффилированныеЛицаСкрытьСтрокиБезИзменений.Пометка Тогда
		ОтборСтрок.Вставить("ЕстьИзменения", Истина);
	КонецЕсли; 
	Элементы.АффилированныеЛица.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрок);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаТолькоСтрокиСОшибкамиЗаполнения(Команда)
	
	Элементы.АффилированныеЛицаКомандаТолькоСтрокиСОшибкамиЗаполнения.Пометка = Не Элементы.АффилированныеЛицаКомандаТолькоСтрокиСОшибкамиЗаполнения.Пометка;
	Если Элементы.АффилированныеЛицаСкрытьСтрокиБезИзменений.Пометка Тогда
		Элементы.АффилированныеЛицаСкрытьСтрокиБезИзменений.Пометка = Не Элементы.АффилированныеЛицаКомандаТолькоСтрокиСОшибкамиЗаполнения.Пометка;
	КонецЕсли; 
	
	ОтборСтрок = Новый Структура;
	Если Элементы.АффилированныеЛицаКомандаТолькоСтрокиСОшибкамиЗаполнения.Пометка Тогда
		ОтборСтрок.Вставить("ЕстьОшибки", Истина);
	КонецЕсли; 
	Элементы.АффилированныеЛица.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрок);
	
КонецПроцедуры

#КонецОбласти 

#Область Служебные_процедуры_и_функции

&НаСервере
Процедура ЗаполнитьТаблицуИзФайлаXML(АдресФайла)
	
	#Область Чтение_XML
	ЧтениеДанных = Новый ЧтениеДанных(ПолучитьИзВременногоХранилища(АдресФайла));
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьПоток(ЧтениеДанных.ИсходныйПоток());
	
	ДанныеXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
		
	ЧтениеXML.Закрыть();
	ЧтениеДанных.Закрыть();
	
	УдалитьИзВременногоХранилища(АдресФайла);
	
	ДанныеXML = Новый ТаблицаЗначений;
	
	ДанныеXML.Колонки.Добавить("Matrix_Partner_ID", 			Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(6)));
	ДанныеXML.Колонки.Добавить("Partner_Name_Full_Official", 	Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(255)));
	ДанныеXML.Колонки.Добавить("INN", 							Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(12)));
	ДанныеXML.Колонки.Добавить("Date_Included", 				Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ДанныеXML.Колонки.Добавить("Is_Firm", 						Новый ОписаниеТипов("Булево"));
	ДанныеXML.Колонки.Добавить("Address", 						Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(255)));
	ДанныеXML.Колонки.Добавить("Matrix_Affiliated_Type", 		Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(3)));
	ДанныеXML.Колонки.Добавить("Affiliated_Type_Description", 	Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(255)));
	ДанныеXML.Колонки.Добавить("Date_From", 					Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ДанныеXML.Колонки.Добавить("Ground_Name", 					Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(255)));
	ДанныеXML.Колонки.Добавить("Change_Description", 			Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(0)));
	ДанныеXML.Колонки.Добавить("Change_Date", 					Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ДанныеXML.Колонки.Добавить("Share", 						Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(260)));
	ДанныеXML.Колонки.Добавить("Matrix_Partner_Code", 			Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(6)));
	
	Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	ИННОрганизации = ПолучитьИННОрганизации(Организация);
	Если НЕ ЗначениеЗаполнено(ИННОрганизации) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить ИНН для организации: " + Организация);
		Возврат;
	ИначеЕсли ДанныеXDTO.Свойства().Получить("Partner")	= Неопределено Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Неверный формат файла!");
		Возврат;
	ИначеЕсли ДанныеXDTO.Partner.INN <> ИННОрганизации Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("ИНН организации в списке аффилированных лиц не равен ИНН текущей организации!");
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.ЮридическоеЛицо = РаботаСВнешнимиСистемами.НайтиЗначениеПоКодуВнешнейСистемы(
		Справочники.ВнешниеСистемы.Матрих, 
		Справочники.ГруппыИмпортируемыхОбъектов.ЮридическиеЛица, 
		СтрЗаменить(ДанныеXDTO.Partner.Matrix_Partner_Code, "MX1/", ""));
	ЭтаФорма.Период = Дата(СтрЗаменить(ДанныеXDTO.Partner.Report_Date, "-", ""));
	
	Для Каждого Affiliate Из ДанныеXDTO.Partner.Affiliates.Affiliate Цикл
		
		Если ТипЗнч(Affiliate.Grounds.Ground) = Тип("СписокXDTO") Тогда
		
			Для каждого Ground Из Affiliate.Grounds.Ground Цикл
				ДобавитьСтрокуИзXMLДанных(ДанныеXML.Добавить(), Affiliate, Ground);
			КонецЦикла;
			
		Иначе
			ДобавитьСтрокуИзXMLДанных(ДанныеXML.Добавить(), Affiliate, Affiliate.Grounds.Ground);
		КонецЕсли; 
		
	КонецЦикла;		
	#КонецОбласти 
	
	#Область Импорт_НСИ
	
	ТаблицаКодов = ДанныеXML.Скопировать(, "Matrix_Partner_Code, Is_Firm");
	ТаблицаКодов.Свернуть("Matrix_Partner_Code, Is_Firm");
		
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеXML.Matrix_Partner_ID КАК Matrix_Partner_ID,
		|	ДанныеXML.Matrix_Partner_Code КАК Matrix_Partner_Code,
		|	ДанныеXML.Partner_Name_Full_Official КАК Partner_Name_Full_Official,
		|	ДанныеXML.INN КАК INN,
		|	ДанныеXML.Date_Included КАК Date_Included,
		|	ДанныеXML.Is_Firm КАК Is_Firm,
		|	ДанныеXML.Address КАК Address,
		|	ДанныеXML.Matrix_Affiliated_Type КАК Matrix_Affiliated_Type,
		|	ДанныеXML.Affiliated_Type_Description КАК Affiliated_Type_Description,
		|	ДанныеXML.Date_From КАК Date_From,
		|	ДанныеXML.Ground_Name КАК Ground_Name,
		|	ДанныеXML.Change_Description КАК Change_Description,
		|	ДанныеXML.Change_Date КАК Change_Date,
		|	ДанныеXML.Share КАК Share,
		|	СтраныМира.Ссылка КАК NationalityCountry
		|ПОМЕСТИТЬ _Данные
		|ИЗ
		|	_ДанныеXML КАК ДанныеXML
		|		ЛЕВОЕ СОЕДИНЕНИЕ _MatrixMigration КАК MatrixMigration
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтраныМира КАК СтраныМира
		|			ПО MatrixMigration.Country = СтраныМира.Код
		|		ПО (MatrixMigration.ID = ДанныеXML.Matrix_Partner_ID)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Matrix_Partner_Code
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_Данные.Matrix_Partner_Code КАК Matrix_Partner_Code,
		|	_Данные.Is_Firm КАК Is_Firm
		|ИЗ
		|	_Данные КАК _Данные
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах КАК КодыЮрФизЛиц
		|		ПО (КодыЮрФизЛиц.ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Матрих))
		|			И _Данные.Matrix_Partner_Code = КодыЮрФизЛиц.Код
		|			И (ВЫБОР
		|				КОГДА _Данные.Is_Firm
		|					ТОГДА КодыЮрФизЛиц.ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ЮридическиеЛица)
		|				ИНАЧЕ КодыЮрФизЛиц.ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ФизическиеЛица)
		|			КОНЕЦ)
		|ГДЕ
		|	КодыЮрФизЛиц.Период ЕСТЬ NULL";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(ДанныеXML, "_ДанныеXML", Запрос,,,,);
	СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(ПолучитьMatrixMigration(), "_MatrixMigration", Запрос,,,); 
	
	ТаблицаКодов = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаКодов.Количество() > 0 Тогда
	
		ИмпортНСИ = Обработки.ИмпортНормативноСправочнойИнформации.Создать();
		ИмпортНСИ.ГруппаПравил                     = "Матрих";
		ИмпортНСИ.ГруппаОбъектов                   = Справочники.ГруппыИмпортируемыхОбъектов.ФизическиеЛица;
		ИмпортНСИ.Организация                      = Организация;
		ИмпортНСИ.Подразделение                    = Справочники.Подразделения.ГруппаКомпаний;
		ИмпортНСИ.Язык                             = Справочники.Языки.Русский;
		ИмпортНСИ.НеСообщатьОСозданииНовыхОбъектов = Истина;
		ИмпортНСИ.НеСообщатьОбОтсутствииИзменений  = Истина;
		
		Для каждого СтрокаXML Из ТаблицаКодов Цикл
			Если Не СтрокаXML.Is_Firm Тогда
				НоваяСтрокаИмпортируемыеОбъекты = ИмпортНСИ.ИмпортируемыеОбъекты.Добавить();
				НоваяСтрокаИмпортируемыеОбъекты.КодВоВнешнейСистеме = СтрокаXML.Matrix_Partner_Code;
			КонецЕсли; 
		КонецЦикла;
		
		Если ИмпортНСИ.ИмпортируемыеОбъекты.Количество() > 0 Тогда
			ИмпортНСИ.ИмпортироватьДанные();
		КонецЕсли; 
		
		ИмпортНСИ.ИмпортируемыеОбъекты.Очистить();
		ИмпортНСИ.ГруппаОбъектов = Справочники.ГруппыИмпортируемыхОбъектов.ЮридическиеЛица;
		
		Для каждого СтрокаXML Из ТаблицаКодов Цикл
			Если СтрокаXML.Is_Firm Тогда
				НоваяСтрокаИмпортируемыеОбъекты = ИмпортНСИ.ИмпортируемыеОбъекты.Добавить();
				НоваяСтрокаИмпортируемыеОбъекты.КодВоВнешнейСистеме = СтрокаXML.Matrix_Partner_Code;
			КонецЕсли;
		КонецЦикла;
		
		Если ИмпортНСИ.ИмпортируемыеОбъекты.Количество() > 0 Тогда
			ИмпортНСИ.ИмпортироватьДанные();
		КонецЕсли; 
	
	КонецЕсли; 
	#КонецОбласти 
		
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_Данные.Partner_Name_Full_Official КАК ПолноеИмя,
	|	_Данные.Address КАК Адрес,
	|	_Данные.INN КАК ИНН,
	|	_Данные.NationalityCountry КАК Гражданство,
	|	КодыОснований.Объект КАК Основание,
	|	_Данные.Affiliated_Type_Description КАК ОснованиеСтрока,
	|	_Данные.Date_From КАК ДатаОснования,
	|	_Данные.Share КАК ДоляАкций,
	|	_Данные.Change_Date КАК Период,
	|	КодыЮрФизЛиц.Объект КАК АффилированноеЛицо,
	|	_Данные.Change_Description КАК СодержаниеИзменения,
	|	КодыОснований.Объект ЕСТЬ NULL
	|		ИЛИ КодыЮрФизЛиц.Объект ЕСТЬ NULL КАК ЕстьОшибки
	|ИЗ
	|	_Данные КАК _Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах КАК КодыЮрФизЛиц
	|		ПО (КодыЮрФизЛиц.ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Матрих))
	|			И _Данные.Matrix_Partner_Code = КодыЮрФизЛиц.Код
	|			И (ВЫБОР
	|				КОГДА _Данные.Is_Firm
	|					ТОГДА КодыЮрФизЛиц.ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ЮридическиеЛица)
	|				ИНАЧЕ КодыЮрФизЛиц.ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ФизическиеЛица)
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах КАК КодыОснований
	|		ПО (КодыОснований.ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Матрих))
	|			И (КодыОснований.ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ОснованияАффилированныхЛиц))
	|			И _Данные.Matrix_Affiliated_Type = КодыОснований.Код";
	
	ЭтаФорма.АффилированныеЛица.Загрузить(Запрос.Выполнить().Выгрузить());
	ОбновитьСтатусы();

КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьMatrixMigration()
	
	РаботаСВнешнимиСистемами.ПодключитьсяКВнешнемуИсточникуMatrixMigration();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AM_vw_Persons_Info.Person_ID КАК ID,
		|	AM_vw_Persons_Info.NationalityCountry КАК Country
		|ИЗ
		|	ВнешнийИсточникДанных.MatrixMigration.Таблица.AM_vw_Persons_Info КАК AM_vw_Persons_Info
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	AM_vw_Organizations.OrganizationID,
		|	AM_vw_Countries.CountryISOCode
		|ИЗ
		|	ВнешнийИсточникДанных.MatrixMigration.Таблица.AM_vw_Organizations КАК AM_vw_Organizations
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВнешнийИсточникДанных.MatrixMigration.Таблица.AM_vw_Countries КАК AM_vw_Countries
		|		ПО AM_vw_Organizations.CountryID = AM_vw_Countries.CountryID";
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Результат = Новый ТаблицаЗначений;
	
	Для Каждого Колонка Из Выгрузка.Колонки Цикл
		Результат.Колонки.Добавить(Колонка.Имя, Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(6)));
	КонецЦикла;
	
	Для Каждого Строка Из Выгрузка Цикл
		НоваяСтрока = Результат.Добавить();
		ID = Строка(Формат(Строка.ID, "ЧГ=0"));
		НоваяСтрока.ID = ID;
		НоваяСтрока.Country = Строка.Country;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьИННОрганизации(Организация)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ИНН КАК ИНН
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|			,
		|			Организация = &Организация
		|				И ЮрФизЛицо В
		|					(ВЫБРАТЬ
		|						Организации.ЮрФизЛицо КАК ЮрФизЛицо
		|					ИЗ
		|						Справочник.Организации КАК Организации
		|					ГДЕ
		|						Организации.Ссылка = &Организация)
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ИНН;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ДобавитьСтрокуИзXMLДанных(СтрокаДанных, ДанныеАЛ, Основание)

	Для каждого Колонка Из СтрокаДанных.Владелец().Колонки Цикл
	
		ЗаполнитьЗначениеКолонкиИзXML(СтрокаДанных, Колонка.Имя, ДанныеАЛ);
		ЗаполнитьЗначениеКолонкиИзXML(СтрокаДанных, Колонка.Имя, Основание);
	
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначениеКолонкиИзXML(Строка, ИмяКолонки, ДанныеXML)

	СвойствоXML = ДанныеXML.Свойства().Получить(ИмяКолонки);
	
	Если СвойствоXML <> Неопределено И ТипЗнч(ДанныеXML[ИмяКолонки]) <> Тип("ОбъектXDTO") Тогда
		
		ЗначениеСвойства = ДанныеXML[ИмяКолонки];
		
		Если ИмяКолонки = "Matrix_Partner_Code" Тогда
			Значение = СтрЗаменить(ЗначениеСвойства, "MX1/", "");
		ИначеЕсли ИмяКолонки = "Is_Firm" Тогда
			Значение = (ЗначениеСвойства = "1");
		ИначеЕсли ТипЗнч(Строка[ИмяКолонки]) = Тип("Дата") Тогда
			Значение = Дата(СтрЗаменить(ЗначениеСвойства, "-", ""));
		Иначе	
			Значение = ЗначениеСвойства;
		КонецЕсли; 
		
		Строка[ИмяКолонки] = Значение;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзмененияНаСервере()
	
	Для каждого СтрокаТаблицаДляЗагрузки Из ЭтаФорма.АффилированныеЛица Цикл
		Если Не СтрокаТаблицаДляЗагрузки.ЯвляетсяАффилированным = Неопределено Тогда
		
			Запись = РегистрыСведений.АффилированныеЛица.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, СтрокаТаблицаДляЗагрузки);
			Запись.ЮридическоеЛицо = ЭтаФорма.ЮридическоеЛицо;
			Запись.Записать();
				
		КонецЕсли; 
	КонецЦикла; 
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатусы(АффилированноеЛицо = Неопределено)

	Если ЗначениеЗаполнено(ЭтаФорма.ЮридическоеЛицо) Тогда
	
		ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	АффилированныеЛица.АффилированноеЛицо КАК АффилированноеЛицо,
			|	АффилированныеЛица.Основание КАК Основание,
			|	АффилированныеЛица.Период КАК Период,
			|	АффилированныеЛица.ПолноеИмя КАК ПолноеИмя,
			|	АффилированныеЛица.Гражданство КАК Гражданство,
			|	АффилированныеЛица.ИНН КАК ИНН,
			|	АффилированныеЛица.СодержаниеИзменения КАК СодержаниеИзменения
			|ПОМЕСТИТЬ _АффилированныеЛица
			|ИЗ
			|	&АффилированныеЛица КАК АффилированныеЛица
			|ГДЕ
			|	АффилированныеЛица.АффилированноеЛицо <> ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕСТЬNULL(_АффилированныеЛица.АффилированноеЛицо, АффилированныеЛицаСрезПоследних.АффилированноеЛицо) КАК АффилированноеЛицо,
			|	ЕСТЬNULL(_АффилированныеЛица.Основание, АффилированныеЛицаСрезПоследних.Основание) КАК Основание,
			|	ЕСТЬNULL(_АффилированныеЛица.Период, &Период) КАК Период,
			|	ЕСТЬNULL(_АффилированныеЛица.ПолноеИмя, АффилированныеЛицаСрезПоследних.ПолноеИмя) КАК ПолноеИмя,
			|	ЕСТЬNULL(_АффилированныеЛица.Гражданство, АффилированныеЛицаСрезПоследних.Гражданство) КАК Гражданство,
			|	ЕСТЬNULL(_АффилированныеЛица.ИНН, АффилированныеЛицаСрезПоследних.ИНН) КАК ИНН,
			|	ЕСТЬNULL(_АффилированныеЛица.СодержаниеИзменения, ""Исключение из списка аффилированных лиц"") КАК СодержаниеИзменения,
			|	ВЫБОР
			|		КОГДА АффилированныеЛицаСрезПоследних.АффилированноеЛицо ЕСТЬ NULL
			|			ТОГДА ""Будет включен""
			|		КОГДА _АффилированныеЛица.АффилированноеЛицо ЕСТЬ NULL
			|			ТОГДА ""Будет исключен""
			|		КОГДА _АффилированныеЛица.Период <> АффилированныеЛицаСрезПоследних.Период
			|			ТОГДА ""Будет обновлен""
			|		ИНАЧЕ ""Входит в список""
			|	КОНЕЦ КАК ТекущееСостояние,
			|	АффилированныеЛицаСрезПоследних.АффилированноеЛицо ЕСТЬ NULL
			|		ИЛИ _АффилированныеЛица.АффилированноеЛицо ЕСТЬ NULL
			|		ИЛИ _АффилированныеЛица.Период <> АффилированныеЛицаСрезПоследних.Период КАК ЕстьИзменения,
			|	ВЫБОР
			|		КОГДА АффилированныеЛицаСрезПоследних.АффилированноеЛицо ЕСТЬ NULL
			|			ТОГДА ИСТИНА
			|		КОГДА _АффилированныеЛица.АффилированноеЛицо ЕСТЬ NULL
			|			ТОГДА ЛОЖЬ
			|		КОГДА _АффилированныеЛица.Период <> АффилированныеЛицаСрезПоследних.Период
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ НЕОПРЕДЕЛЕНО
			|	КОНЕЦ КАК ЯвляетсяАффилированным
			|ИЗ
			|	_АффилированныеЛица КАК _АффилированныеЛица
			|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.АффилированныеЛица.СрезПоследних(&Период, ЮридическоеЛицо = &ЮридическоеЛицо) КАК АффилированныеЛицаСрезПоследних
			|		ПО _АффилированныеЛица.АффилированноеЛицо = АффилированныеЛицаСрезПоследних.АффилированноеЛицо
			|			И _АффилированныеЛица.Основание = АффилированныеЛицаСрезПоследних.Основание
			|ГДЕ
			|	(АффилированныеЛицаСрезПоследних.ЯвляетсяАффилированным
			|			ИЛИ НЕ _АффилированныеЛица.АффилированноеЛицо ЕСТЬ NULL)";
		
		НайденныеСтроки = Неопределено;
		Если ЗначениеЗаполнено(АффилированноеЛицо) Тогда
			НайденныеСтроки = ЭтаФорма.АффилированныеЛица.НайтиСтроки(Новый Структура("АффилированноеЛицо", АффилированноеЛицо)); 
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОЛНОЕ СОЕДИНЕНИЕ", "ЛЕВОЕ СОЕДИНЕНИЕ");
		КонецЕсли; 
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Период", ЭтаФорма.Период);
		Запрос.УстановитьПараметр("ЮридическоеЛицо", ЭтаФорма.ЮридическоеЛицо);
		Запрос.УстановитьПараметр("АффилированныеЛица", 
			ЭтаФорма.АффилированныеЛица.Выгрузить(НайденныеСтроки, 
				"АффилированноеЛицо, 
				|Основание, 
				|Период, 
				|ПолноеИмя,
				|Гражданство,
				|ИНН, 
				|СодержаниеИзменения"));
				
		Запрос.Текст = ТекстЗапроса;
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
					
			НайденныеСтроки = ЭтаФорма.АффилированныеЛица.НайтиСтроки(Новый Структура("АффилированноеЛицо, Основание", Выборка.АффилированноеЛицо, Выборка.Основание));
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				Для каждого СтрокаНайденныеСтроки Из НайденныеСтроки Цикл
					
					ЗаполнитьЗначенияСвойств(СтрокаНайденныеСтроки, Выборка);
					
					Если Не ЗначениеЗаполнено(СтрокаНайденныеСтроки.ПолноеИмя) Тогда
						// сюда попадем, если аффилированное лицо выбрали руками, и ранее была добавлена строка к удалению (см. ниже)
						ЭтаФорма.АффилированныеЛица.Удалить(СтрокаНайденныеСтроки);
					КонецЕсли; 
					
				КонецЦикла; 				
			Иначе
				// если аффилированное лицо по наименованию не нашли, но оно ранее было в списке - добавим его в конец списка, как строку к удалению
				ЗаполнитьЗначенияСвойств(ЭтаФорма.АффилированныеЛица.Добавить(), Выборка);			
			КонецЕсли;
		
		КонецЦикла; 
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АффилированныеЛицаАффилированноеЛицоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуМодально("Справочник.ЮрФизЛица.Форма.ФормаВыбора", Новый Структура("Период", ЭтаФорма.Период), Элемент);
КонецПроцедуры

#КонецОбласти
